label Airport:
    '''
    Ох наконец-то встал.
    Спина сейчас благодорит меня.
    '''

    scene Airport
    with fade

    stop music fadeout 2.0
    play music Noise_Of_People

    '''
    Эх, вот только вопроc: "Куда теперь?" Очередь как пробка на шоссе.

    Все столпились не протолкнёшься. И ведь каждый второй ещё с чемоданом.

    Ну что ж, выбирать не приходится, так что ждём.
    '''

    scene Airport
    with fade

    '''
    Надеюсь, что по пути в МФТИ будет не так же много людей, как здесь.
    '''

    scene Airport
    with fade

    '''
    Наконц-то моя очередь подошла.
    '''

    scene Airport_Customs_Officer
    with fade

    Mark '''
    Добрый день.
    '''

    Customs_Officer '''
    Добрый, ваш паспорт пожалуйста.
    Цель визита?
    '''

    Mark '''
    Учёба. Приехал на обучение в университет.
    '''

    Customs_Officer '''
    Понял. Что за университет, в каком городе?
    '''

    Mark '''
    Поступил в МФТИ, Долгопрудный.
    '''

    Customs_Officer '''
    На какой срок остаётесь?
    '''

    Mark '''
    На год, потом планирую продлить, если всё будет хорошо.
    '''

    Customs_Officer '''
    Вы знаете правила пребывания и регистрации?
    '''

    Mark '''
    Да, меня в университете уже обо всём проинструктировали.
    '''

    Customs_Officer '''
    Отлично. Приветствую в России, хорошей учёбы.
    '''

    Mark '''
    Спасибо, хорошего вам дня.
    '''

    stop music fadeout 2.0
    play music Normal

    scene Airport_Entrance
    with fade

    '''
    Погода на улице к счастью хорошая, не слишком жарко и не холодно, в самый раз.

    Так, теперь надо понять, как быстрее добраться до МФТИ...

    Такси — дорого, конечно, но, может, ради первого раза стоит взять?

    Хотя... если сэкономить, то можно на «Аэроэкспрессе» до Белорусской, а оттуда на метро и автобусе.

    Вроде бы не так уж и сложно. Но вот с багажом таскаться будет неудобно...

    Ладно, разберусь по ходу дела.

    Было бы здорово, конечно, если бы кто-то встретил, но вряд ли, я всё таки не заполнил форму, чтобы меня встретили.

    Всё, надо выбрать и двигаться — и так уже, наверное, задерживаюсь, ещё заселиться нужно.
    '''

    menu:
        "Как поехать?"

        "Поехать на такси.":
            jump From_Airport_To_MIPT_Taxi

        "Поехать на метро.":
            jump From_Airport_To_MIPT_Bus

    return