label From_Airport_To_MIPT_Taxi:
    '''
    Ну вот, заказал такси. Осталось подождать.

    Надеюсь водитель найдёт меня без проблем - аэропорт всё-таки, здесь постоянно толпы.

    МФТИ... Всегда мечтал там побывать.

    Слышал столько всего: как там атмосферно, сколько там умных людей, какой высокий уровень преподавания.
    '''

    scene Airport_Entrance
    with fade

    '''
    Посмотрю, где сейчас такси, вдруг водитель попал в пробку...

    Нет, вроде приложение показывает, что через пару минут уже будет у меня.

    Хочу оказаться там быстрее, но одновременно чувствую, как будто ещё что-то меня тянет задержаться, перевести дух.

    Как только машина приедет, впереди будет нечто новое - даже немного волнуюсь.

    Похоже это моё такси подъехало.
    '''

    Mark '''
    Здравствуйте! Это я вас вызывал, мне нужно в МФТИ.
    '''

    Taxi_Driver '''
    Здравствуйте! Давайте ваш багаж, помогу поставить.

    Вы значит в университет?
    '''

    Mark '''
    Да поступать приехал. Долго готовился. Это, наверное, будет важнейшая поездка в моей жизни.
    '''

    Taxi_Driver '''
    Понимаю, МФТИ - серьёзное место. А издалека добирались?
    '''

    Mark '''
    Из Минска. Лететь было не сложно.
    '''

    Taxi_Driver '''
    Вы выходит, физикой увлекаетесь, раз сюда поступать прилетели?
    '''

    Mark '''
    Почти, физика конечно мне давалась не сложно, но я больше по математике и программированию.

    Говорят, там атмосфера особая и преподаватели классные.
    '''

    Taxi_Driver '''
    Верно говорят, всё таки не зря лучший вуз страны.

    Слышал, что выпускники на вес золота.

    Ну, поехали, уверен вы справитесь и вам понравится здесь.
    '''

    Mark '''
    Спасибо за поддержку, надеюсь так и будет.
    '''

    scene From_Airport_To_MIPT_Taxi
    with fade

    Taxi_Driver '''
    А вы, значит, один приехали, без родителей?
    '''

    Mark '''
    Да, решил сам справиться. Надо привыкать к самостоятельной жизни.
    '''

    Taxi_Driver '''
    Правильно, это полезный опыт. Москва — город не из простых, но и возможностей тут, сами знаете, полно.

    Главное — держитесь уверенно. Как говорится, первый шаг всегда сложнее.
    '''

    Mark '''
    Это точно… Всё равно немного страшно.
    Всё-таки МФТИ. Конкурс большой, а ребята тут, не глупые собрались, каждый со своей историей успеха.
    '''

    Taxi_Driver '''
    Ну так, вы же тоже не просто так тут, раз приехали. Значит, тоже много умеете и знаете.
    Всё у вас получится.
    '''

    Mark '''
    Спасибо!А как вам вообще в Москве работать, не трудно?
    '''

    Taxi_Driver '''
    Трудно, конечно. Город живой, не заскучаешь, но и нервы иногда нужны крепкие.

    А в такси — видите сами, работы много. Но есть плюс: встречаю таких, как вы.

    Люди сюда ведь не просто так едут. Слушаю истории, помогаю — вроде бы тоже часть чьей-то истории.
    '''

    Mark '''
    Наверное много интересных историй знаете, расскажите?
    '''

    Taxi_Driver '''
    Что ж путь не близкий, давай расскажу пару тройку.
    '''

    scene From_Airport_To_MIPT_Taxi
    with fade

    Taxi_Driver '''
    Думаю, получилось у него. Важно просто не бояться бороться за своё, пока ещё есть за что.
    '''

    Mark '''
    Да... Наверное, так.
    '''

    Taxi_Driver '''
    Ладно, держись там, парень. И береги то, что имеешь.
    '''

    Mark '''
    Спасибо вам. За всё.
    '''

    Taxi_Driver '''
    Удачи тебе во всём.
    '''

    jump FirstAcquaintance

    return
