# Вы можете расположить сценарий своей игры в этом файле.

#___________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________
# Cценарий
# Персонажи

# Марк — Главный герой, жизнерадостный и любознательный парень. Его цель — закончить ФПМИ и найти свое место в жизни, совмещая учебу с личными интересами. Любит программирование, математику, гитару и настольные игры.

# Максим Олегович Голубев — Преподаватель математического анализа. Серьезный и требовательный к студентам, но понимающий, что работа с первокурсниками требует терпения. Постоянно ставит сложные задачи, чтобы проверить стойкость студентов.

# Шахром Илхомджонович Аминов — Преподаватель алгоритмов и структур данных, грозный и строгий наставник, который не терпит халатного отношения к предмету. Может казаться резким, но уважаем студентами за глубокие знания и профессионализм.

# Илья Семирович Мещерин — Преподаватель C++. Взгляд на программирование у него суровый, и он уверен, что его предмет — важнейшая часть подготовки каждого студента. Может подшутить на тему: «Что ты выберешь, C++ или секс?»

# Ольга Геннадьевна Подлипская — Преподаватель аналитической геометрии, справедливая и отзывчивая наставница. Важно, чтобы ее студенты чувствовали себя уверенно, осваивая предмет.

# Андрей Михайлович Райгородский — Директор ФПМИ. Энергичный, умный, иногда заигрывает с молодежной культурой, но его серьезный подход к будущему своих студентов заставляет их уважать его.

# Лиза Вох — Однокурсница, амбициозная и харизматичная. Она поддерживает Марка и интересуется его жизнью. Легко находит общий язык со всеми, что делает ее популярной среди студентов.

# Агафонова Анна — Однокурсница, которая заботится о Марке и его успехах, отличница и надежный друг. Уравновешенная и добрая, помогает справляться со сложными задачами.

# Жаркынай («Най») — Однокурсница из Казахстана, активная и яркая личность. Она заряжает Марка энергией и всегда поддерживает моральный дух команды.

# Рома Дроздов — Однокурсник, спокойный и рассудительный. Любит философствовать и задавать глубокие вопросы о жизни, иногда подшучивает над преподавателями.

# Иброхим Саидов — Однокурсник, решительный и немного рисковый, может поддержать друга в авантюре. Быстро становится товарищем Марка, иногда зовет его на неожиданные мероприятия.

# Евгений и Ирина — Родители Марка, которые беспокоятся о его адаптации и поддерживают его решение учиться в другой стране. Их взгляды на учебу и личную жизнь сына иногда расходятся, что добавляет конфликтов.

# Ключевые события и повороты
# Первые недели в МФТИ — Игрок знакомится с преподавателями и одногруппниками, сталкивается с первыми трудностями учебы и обретает друзей.

# Жизнь вне учебы — В игре будут организованы внеучебные события: посиделки с друзьями, фестивали, настольные игры, гитарные вечера, которые Марк сможет посетить или пропустить ради учебы.

# Экзаменационные недели — Игроку предстоит расставить приоритеты и выбирать: готовиться к экзаменам, отдыхать или искать поддержки у друзей. В зависимости от подготовки, Марк может сдать или завалить экзамен, что повлияет на его путь.

# Развитие романтических линий — Марк может строить отношения с Шахромом(секретный выбор), Лизой, Аней или Най. Разные выборы определят, с кем он сблизится, и как это повлияет на его дальнейшую жизнь.

# Конфликт и поддержка родителей — Периодически Марк общается с родителями, которые озабочены его состоянием. Он может либо принимать их поддержку, либо пытаться справляться в одиночку.

# Финальные экзамены и выборы пути — Ближе к концу игры Марк столкнется с последним испытанием, где его выборы определят исход его учебы и личной жизни.

# Возможные концовки
# Трагическая концовка: Из-за непомерной нагрузки и отсутствия поддержки Марк уходит из жизни, что становится шокирующим финалом для игроков.

# Счастливая концовка: Марк заканчивает МФТИ с отличием и сходится с одной из девушек. Его ждет прекрасное будущее, любимая работа и счастливая семья.

# Смешанная концовка: Марк сходится с девушкой, но не заканчивает МФТИ. Его выгоняют из университета, но он доволен, так как нашел свою любовь, хотя с учебой не сложилось.

# Концовка борьбы: Марк один и не завершает МФТИ. Он находит работу, но ощущает разочарование от того, что не смог оправдать свои ожидания.

# Успех без романтики: Марк заканчивает МФТИ, но остается одиноким. Он полностью погружается в работу, но чувствует отсутствие близкого человека в своей жизни.

#___________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________


# Определение персонажей игры.

# Главный герой
define Mark = Character('Марк', color = "#000000")

# Родители главного героя
define Mother = Character("Мама", color = "#fcfda8")
define Father = Character("Папа", color = "#480da7")

# Персонажи-преподаватели
define Semirovich_Ilya = Character("Илья", color = "#F2DE4A")
define Olga_Genadyevna = Character("Ольга", color = "#DA1310")
define Aminov_Shahrom = Character('Шахром', color = "#0034a5")
define Maksim_Olegovich = Character('Максим', color = "#DA1310")
define Andrej_Mihailovich = Character('Райгородсикй', color = "#4C674E")

# Персонажи-ученики
define Drozdov_Roman = Character('Рома', color = "#5fee5a")
define Agafonova_Anna = Character('Аня', color = "#df8b1e")
define Vokh_Elizaveta = Character('Лиза', color = "#691F1C")
define Ibrokhim_Saidov = Character('Иброхим', color = "#ff6600")
define Zheldenbaeva_Zharknai = Character('Най', color = "#34a0e7")

# Персонажи которые будут задействованы единожды
define Taxi_Driver = Character("Таксист", color = "#cbbe01")
define Steward = Character("Бортпроводник", color = "#34a0e7")
define Customs_Officer = Character("Таможенник", color = "#008a0b")
define Attention_Airplane = Character("Объявление", color = "#ff1818")


# Музыка/звуки для игры

# Музыкальное сопровождение
define audio.Sad = "audio/Backdrop/Sad.ogg"
define audio.Relax = "audio/Backdrop/Relax.ogg"
define audio.Scary = "audio/Backdrop/Scary.ogg"
define audio.Normal = "audio/Backdrop/Normal.ogg"

# КИШ-Король и Шут
define audio.Woodsman = "audio/The_King_and_the_Jester/Woodsman.ogg"
define audio.Eat_Meat_Men = "audio/The_King_and_the_Jester/Eat_Meat_Men.ogg"
define audio.Sorcerers_Doll = "audio/The_King_and_the_Jester/Sorcerers_Doll.ogg"
define audio.Fool_And_Polnias = "audio/The_King_and_the_Jester/Fool_And_Polnias.ogg"
define audio.A_Rock_To_The_Head = "audio/The_King_and_the_Jester/A_Rock_To_The_Head.ogg"

# Звуки
define audio.Metro = "audio/Sounds/Metro.ogg"
define audio.Lesson = "audio/Sounds/Lesson.ogg"
define audio.Silence = "audio/Sounds/Silence.ogg"
define audio.Attention = "audio/Sounds/Attention.ogg"
define audio.Sunny_City = "audio/Sounds/Sunny_City.ogg"
define audio.Rain_In_City = "audio/Sounds/Rain_In_City.ogg"
define audio.Noise_Of_People = "audio/Sounds/Noise_Of_People.ogg"

# Персонажи
image Steward_Normal = "images/Characters/Steward_Normal.png"

# Сцены
image Airport = "images/Backdrop/Airport.jpg"
image Subway_Below = "images/Backdrop/Subway_Below.jpg"
image Subway_Inside = "images/Backdrop/Subway_Inside.jpg"
image Airport_Entrance = "images/Backdrop/Airport_Entrance.jpg"
image MIPT_MainBuildimg = "images/Backdrop/MIPT_MainBuildimg.jpg"
image Airport_Customs_Officer = "images/Backdrop/Airport_Custom_Officer.jpg"
image Sky_From_Airplane = "images/Backdrop/Sky_From_Airplane.jpg" # Вид из окна самолёта
image Backdrop_Airplane = "images/Backdrop/Backdrop_Airplane.jpg" # Спинка кресла самолёта
image From_Airport_To_MIPT_Bus = "images/Backdrop/From_Airport_To_MIPT_Bus.jpg" # Метро со стороны по Москве
image From_Airport_To_MIPT_Taxi = "images/Backdrop/From_Airport_To_MIPT_Taxi.jpg" # Такси со стороны по Москве
